## Staging: dns
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 5 to add, 1 to change, 3 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                             NAME                             |
|----------|--------------------------------------------------------------|
| add      | `aws_secretsmanager_secret.internal_dns_fqdn`                |
|          | `aws_secretsmanager_secret_version.internal_dns_fqdn`        |
| update   | `aws_acm_certificate.internal_dns`                           |
| recreate | `aws_route53_zone.internal_dns`                              |
|          | `aws_secretsmanager_secret_version.internal_dns_cert_base64` |
|          | `tls_self_signed_cert.internal_dns`                          |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_acm_certificate.internal_dns will be updated in-place
  ~ resource "aws_acm_certificate" "internal_dns" {
      ~ certificate_body          = <<-EOT
            -----BEGIN CERTIFICATE-----
            MIIDEzCCAfugAwIBAgIQaJRC/PZYAYJvWVA93LYS3DANBgkqhkiG9w0BAQsFADAq
            MSgwJgYDVQQDDB8qLnN0YWdpbmcubm90aWZpY2F0aW9uLmludGVybmFsMB4XDTI0
            MDIwMTE4MDA0NVoXDTI5MDEzMDE4MDA0NVowKjEoMCYGA1UEAwwfKi5zdGFnaW5n
            Lm5vdGlmaWNhdGlvbi5pbnRlcm5hbDCCASIwDQYJKoZIhvcNAQEBBQADggEPADCC
            AQoCggEBALv1HiO7Hxx8+ILDr5Ea+Sknjdc+rN45ZHCsllGKDRbn360mIQJsmoGS
            s92z+XrSdo3X0ZooYkHy8MR3JrU5TrI2jaTi0C7GeFhpwfOtj/PxSsi9pgjJEORv
            B3ZtpD9qulriXyu/pvVbGccWaf7ynKVh2JCnkURa4O/0jUMZjulBmlrNROrs7bYS
            61UrxV07ynrOQ8KHIIPLwXODL02e0uudbZ1sbs6/K6oIQh4wrs5DqxvN0Y0yL1LG
            LGqO2d3L5WM63232UWtyP9vF0t9elvidnxulX7L12UFbFHZPcrRDPbFoT7GLoJyb
            p6TK/WmZbSO7nzSomZz9N8hJ9KTtLiUCAwEAAaM1MDMwDgYDVR0PAQH/BAQDAgWg
            MBMGA1UdJQQMMAoGCCsGAQUFBwMBMAwGA1UdEwEB/wQCMAAwDQYJKoZIhvcNAQEL
            BQADggEBACXBo43jw5EL02XMuwWbI6U9B8dhLE/XGGivpACV8PerD22wnCwavm6s
            WmNaWghClqJ3R1g1pm6j8gUPTd0MWL/jiviy14z4W6MvVDFvr3ulfN6pHMppgzTZ
            8/4FrexwgUYBHNBgHyXEqy/JZIhJPp1rtprdaB4ITABZsseT8AXk7q2O0CfRt8ql
            nybEaqGUEcrsAUdy2QxriByt3jNjK5qdL/iFx4lTiHQRCVMfI8NsVsBxCSwX/u9W
            LDYtrefZJAWiR6WqidTozZaK3xa81eF8gpGBr2pRe2AqZfsbhkurFcwQ06UoiMJA
            4rCkadpSOXKbKvAavGfM4G8tJnufcJs=
            -----END CERTIFICATE-----
        EOT -> (known after apply)
        id                        = "arn:aws:acm:ca-central-1:239043911459:certificate/ee889f75-237c-4d72-9833-61a0296b2db8"
        tags                      = {
            "CostCenter" = "notification-canada-ca-staging"
            "Name"       = "notification-canada-ca"
        }
        # (16 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_route53_zone.internal_dns must be replaced
+/- resource "aws_route53_zone" "internal_dns" {
      ~ arn                 = "arn:aws:route53:::hostedzone/Z02876331ZPQRHQIX5GMX" -> (known after apply)
      ~ id                  = "Z02876331ZPQRHQIX5GMX" -> (known after apply)
      ~ name                = "staging.notification.internal" -> "staging.notification.internal.com" # forces replacement
      ~ name_servers        = [
          - "ns-0.awsdns-00.com.",
          - "ns-1024.awsdns-00.org.",
          - "ns-1536.awsdns-00.co.uk.",
          - "ns-512.awsdns-00.net.",
        ] -> (known after apply)
      ~ primary_name_server = "ns-0.awsdns-00.com." -> (known after apply)
      - tags                = {} -> null
      ~ tags_all            = {} -> (known after apply)
      ~ zone_id             = "Z02876331ZPQRHQIX5GMX" -> (known after apply)
        # (2 unchanged attributes hidden)

      - vpc {
          - vpc_id     = "vpc-097508d1f5e243195" -> null
          - vpc_region = "ca-central-1" -> null
        }
      + vpc {
          + vpc_id     = "vpc-097508d1f5e243195"
          + vpc_region = (known after apply)
        }
    }

  # aws_secretsmanager_secret.internal_dns_fqdn will be created
  + resource "aws_secretsmanager_secret" "internal_dns_fqdn" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "INTERNAL_DNS_FQDN"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + tags_all                       = (known after apply)
    }

  # aws_secretsmanager_secret_version.internal_dns_cert_base64 must be replaced
-/+ resource "aws_secretsmanager_secret_version" "internal_dns_cert_base64" {
      ~ arn            = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:INTERNAL_DNS_CERT_BASE64-NZPM7t" -> (known after apply)
      ~ id             = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:INTERNAL_DNS_CERT_BASE64-NZPM7t|71B5392A-5DB9-435E-AC96-C5BDF3F5C8E8" -> (known after apply)
      ~ secret_string  = (sensitive value) # forces replacement
      ~ version_id     = "71B5392A-5DB9-435E-AC96-C5BDF3F5C8E8" -> (known after apply)
      ~ version_stages = [
          - "AWSCURRENT",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # aws_secretsmanager_secret_version.internal_dns_fqdn will be created
  + resource "aws_secretsmanager_secret_version" "internal_dns_fqdn" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # tls_self_signed_cert.internal_dns must be replaced
+/- resource "tls_self_signed_cert" "internal_dns" {
      ~ cert_pem              = <<-EOT
            -----BEGIN CERTIFICATE-----
            MIIDEzCCAfugAwIBAgIQaJRC/PZYAYJvWVA93LYS3DANBgkqhkiG9w0BAQsFADAq
            MSgwJgYDVQQDDB8qLnN0YWdpbmcubm90aWZpY2F0aW9uLmludGVybmFsMB4XDTI0
            MDIwMTE4MDA0NVoXDTI5MDEzMDE4MDA0NVowKjEoMCYGA1UEAwwfKi5zdGFnaW5n
            Lm5vdGlmaWNhdGlvbi5pbnRlcm5hbDCCASIwDQYJKoZIhvcNAQEBBQADggEPADCC
            AQoCggEBALv1HiO7Hxx8+ILDr5Ea+Sknjdc+rN45ZHCsllGKDRbn360mIQJsmoGS
            s92z+XrSdo3X0ZooYkHy8MR3JrU5TrI2jaTi0C7GeFhpwfOtj/PxSsi9pgjJEORv
            B3ZtpD9qulriXyu/pvVbGccWaf7ynKVh2JCnkURa4O/0jUMZjulBmlrNROrs7bYS
            61UrxV07ynrOQ8KHIIPLwXODL02e0uudbZ1sbs6/K6oIQh4wrs5DqxvN0Y0yL1LG
            LGqO2d3L5WM63232UWtyP9vF0t9elvidnxulX7L12UFbFHZPcrRDPbFoT7GLoJyb
            p6TK/WmZbSO7nzSomZz9N8hJ9KTtLiUCAwEAAaM1MDMwDgYDVR0PAQH/BAQDAgWg
            MBMGA1UdJQQMMAoGCCsGAQUFBwMBMAwGA1UdEwEB/wQCMAAwDQYJKoZIhvcNAQEL
            BQADggEBACXBo43jw5EL02XMuwWbI6U9B8dhLE/XGGivpACV8PerD22wnCwavm6s
            WmNaWghClqJ3R1g1pm6j8gUPTd0MWL/jiviy14z4W6MvVDFvr3ulfN6pHMppgzTZ
            8/4FrexwgUYBHNBgHyXEqy/JZIhJPp1rtprdaB4ITABZsseT8AXk7q2O0CfRt8ql
            nybEaqGUEcrsAUdy2QxriByt3jNjK5qdL/iFx4lTiHQRCVMfI8NsVsBxCSwX/u9W
            LDYtrefZJAWiR6WqidTozZaK3xa81eF8gpGBr2pRe2AqZfsbhkurFcwQ06UoiMJA
            4rCkadpSOXKbKvAavGfM4G8tJnufcJs=
            -----END CERTIFICATE-----
        EOT -> (known after apply)
      ~ id                    = "139009530177464904892523220980861375196" -> (known after apply)
      ~ key_algorithm         = "RSA" -> (known after apply)
      ~ validity_end_time     = "2029-01-30T18:00:45.480558864Z" -> (known after apply)
      ~ validity_start_time   = "2024-02-01T18:00:45.480558864Z" -> (known after apply)
        # (8 unchanged attributes hidden)

      ~ subject { # forces replacement
          ~ common_name = "*.staging.notification.internal" -> "staging.notification.internal.com" # forces replacement
        }
    }

Plan: 5 to add, 1 to change, 3 to destroy.

Changes to Outputs:
  + internal_dns_name              = "staging.notification.internal.com"
  ~ internal_dns_zone_id           = "Z02876331ZPQRHQIX5GMX" -> (known after apply)
  ~ notification_internal_dns_cert = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSURFekNDQWZ1Z0F3SUJBZ0lRYUpSQy9QWllBWUp2V1ZBOTNMWVMzREFOQmdrcWhraUc5dzBCQVFzRkFEQXEKTVNnd0pnWURWUVFEREI4cUxuTjBZV2RwYm1jdWJtOTBhV1pwWTJGMGFXOXVMbWx1ZEdWeWJtRnNNQjRYRFRJMApNREl3TVRFNE1EQTBOVm9YRFRJNU1ERXpNREU0TURBME5Wb3dLakVvTUNZR0ExVUVBd3dmS2k1emRHRm5hVzVuCkxtNXZkR2xtYVdOaGRHbHZiaTVwYm5SbGNtNWhiRENDQVNJd0RRWUpLb1pJaHZjTkFRRUJCUUFEZ2dFUEFEQ0MKQVFvQ2dnRUJBTHYxSGlPN0h4eDgrSUxEcjVFYStTa25qZGMrck40NVpIQ3NsbEdLRFJibjM2MG1JUUpzbW9HUwpzOTJ6K1hyU2RvM1gwWm9vWWtIeThNUjNKclU1VHJJMmphVGkwQzdHZUZocHdmT3RqL1B4U3NpOXBnakpFT1J2CkIzWnRwRDlxdWxyaVh5dS9wdlZiR2NjV2FmN3luS1ZoMkpDbmtVUmE0Ty8walVNWmp1bEJtbHJOUk9yczdiWVMKNjFVcnhWMDd5bnJPUThLSElJUEx3WE9ETDAyZTB1dWRiWjFzYnM2L0s2b0lRaDR3cnM1RHF4dk4wWTB5TDFMRwpMR3FPMmQzTDVXTTYzMjMyVVd0eVA5dkYwdDllbHZpZG54dWxYN0wxMlVGYkZIWlBjclJEUGJGb1Q3R0xvSnliCnA2VEsvV21aYlNPN256U29tWno5TjhoSjlLVHRMaVVDQXdFQUFhTTFNRE13RGdZRFZSMFBBUUgvQkFRREFnV2cKTUJNR0ExVWRKUVFNTUFvR0NDc0dBUVVGQndNQk1Bd0dBMVVkRXdFQi93UUNNQUF3RFFZSktvWklodmNOQVFFTApCUUFEZ2dFQkFDWEJvNDNqdzVFTDAyWE11d1diSTZVOUI4ZGhMRS9YR0dpdnBBQ1Y4UGVyRDIyd25Dd2F2bTZzCldtTmFXZ2hDbHFKM1IxZzFwbTZqOGdVUFRkME1XTC9qaXZpeTE0ejRXNk12VkRGdnIzdWxmTjZwSE1wcGd6VFoKOC80RnJleHdnVVlCSE5CZ0h5WEVxeS9KWkloSlBwMXJ0cHJkYUI0SVRBQlpzc2VUOEFYazdxMk8wQ2ZSdDhxbApueWJFYXFHVUVjcnNBVWR5MlF4cmlCeXQzak5qSzVxZEwvaUZ4NGxUaUhRUkNWTWZJOE5zVnNCeENTd1gvdTlXCkxEWXRyZWZaSkFXaVI2V3FpZFRvelphSzN4YTgxZUY4Z3BHQnIycFJlMkFxWmZzYmhrdXJGY3dRMDZVb2lNSkEKNHJDa2FkcFNPWEtiS3ZBYXZHZk00Rzh0Sm51ZmNKcz0KLS0tLS1FTkQgQ0VSVElGSUNBVEUtLS0tLQo=" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.internal_dns"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.dev_dns_manager[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.production_dns_manager[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.scratch_dns_manager[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.staging_dns_manager[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.internal_dns"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.notification-sandbox[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.internal_dns_cert_base64"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.internal_dns_fqdn"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.internal_dns_key_base64"]

29 tests, 19 passed, 10 warnings, 0 failures, 0 exceptions

```

</details>
